Tekla Open API Reference for Tekla Structures 2025
AnalysisModelIssue.Description Property
 Gets or sets the description of the issue, translated to the current language
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnalysisModelIssue Class
Tekla.Structures.Analysis Namespace